* Quick notes

:LOGBOOK:
CLOCK: [2017-10-02 周一 11:09]--[2017-10-02 周一 11:10] =>  0:01
CLOCK: [2017-09-29 周五 11:03]j


CLOCK: [2017-09-28 周四 13:41]--[2017-09-28 周四 13:42] =>  0:01
:END:
** org time budget [#B]                                              :@work:
:LOGBOOK:
CLOCK: [2017-10-14 周六 23:23]--[2017-10-14 周六 23:30] =>  0:07
:END:
                         Added: [2017-10-14 周六 23:23]
** 秀才饿死不买书 [#B]                                               :@F708:
:LOGBOOK:
CLOCK: [2017-10-15 周日 00:29]--[2017-10-15 周日 00:29] =>  0:00
:END:
                         Added: [2017-10-15 周日 00:28]
                        
壮士饿死不迈剑 
** 工作 [#B]                                                         :@work:
:LOGBOOK:
CLOCK: [2017-10-15 周日 01:18]--[2017-10-15 周日 01:24] =>  0:06
:END:
                         Added: [2017-10-15 周日 01:17]
                         
1. 你做了什么
2. 你希望的结果是什么
3. 实际上的结果是什么
https://github.com/marboo/orgmode-cn/blob/master/org.org#Clocking%20work%20time


8.1 时间戳
http://www.cnblogs.com/Open_Source/archive/2011/07/17/2108747.html#sec-8
跟普通时间戳一样，但是这里是方括号而不是尖括号。这种时间戳是未激活的
，它 不 会让一个条目显示在议程中
** defmulti [#B]                                                     :@work:
:LOGBOOK:
CLOCK: [2017-10-15 周日 13:49]--[2017-10-15 周日 13:49] =>  0:00
:END:
                         Added: [2017-10-15 周日 13:49]

                         http://clojuredocs.org/clojure.core/defmulti
** clojure programming [#B]                                          :@F708:
:LOGBOOK:
CLOCK: [2017-10-16 周一 09:16]--[2017-10-16 周一 10:23] =>  1:07
:END:
                         Added: [2017-10-16 周一 09:15]
                         
programming clojure2012.pdf

Chapter7

Macro

With most programming techniques, you build features within language.

when you write macros, it is more accurate to say that you area
"adding features to" the language. This is a powerful and dangerous
ability, so you should follow the rules in 7.1

At least until you have enough experience to decide for yourself when
to bend the rules.

While powerful, macros are not always simple. Clojure works to make macros
as simple as feasible by including convenience to solve many common
problems that occur when writing macros.

taxonomy(分类系统) taxonomy of Macros(7.4 introduces a taxonomy of 
clojure macros, based on the macros in clojure and contrib libraries.

In clojure, you just implement feature X using a macro(while in most
languages, you sense that incompleteness whenever you say,"My life
would be easier if only my language had feature X."

Some expressions, such as
1. numbers
   1. Integers
   2. floats
   3. rationals
2. symbols
3. keywords(numbers,symbols and keywords are self evaluating)
4. Booleans
5. characters
6. functions
7. functions calls
8. macros
9. strings
10. literal maps
11. vectors
12. queues
13. records
14. sets
** PIC [#B]                                                          :@F708:
:LOGBOOK:
CLOCK: [2017-10-25 周三 18:32]--[2017-10-25 周三 18:33] =>  0:01
:END:
                         Added: [2017-10-25 周三 18:32]
                         
PIC:记忆时候需要考虑三个组成部分，一purpose二interesting三curiosity也就是你要对你的记忆的目的有一个理性的认识，
进行理性的思考，才能明白其重要性，才能让你持续性工作(理性和专注)，这个过程还得有趣，这样能够保持你的好奇心

当你能跟别人讲的清楚的时候，事先你的记忆也肯定是完全清楚的

好奇心和童心挺像，也就是保持空杯状态

目标写在纸上，量化并且场景化，会让你理性和专注* Quick notes
** fortran+c混编 [#B]                                             :PERSONAL:
:LOGBOOK:
CLOCK: [2017-10-14 周六 22:24]--[2017-10-14 周六 22:25] =>  0:01
:END:
                         Added: [2017-10-12 周四 21:31]
                         
你肯定是没用 ISO_C_binding
现在有了规范的混编方法，一切都简单而优

** logical sequence introduction [#B]                                :@work:
:LOGBOOK:
CLOCK: [2017-10-29 周日 22:06]--[2017-10-29 周日 22:15] =>  0:09
:END:
                         Added: [2017-10-29 周日 22:05]
                         

Before we look at the primary collection types individually, we'll 
discuss the things they have in common. For example, you may have 
heard of clojure's sequence abstraction(都是基于sequence)---all the
persistent collection use it(all :keyword, they :keyword , collective
nouns and abjectives), so we'll examine that as well as some algorithmic
complexity concepts we'll refer to throughout the chapter.


Before....individually ... in common....

is very important. 一方面可以体现出你的逻辑的完整性，另一方面体现你的专业性
同时也可以让你把握重要性，这部分内容只是描述性部分，充当点缀，不是特别核心的地方
相当于引言部分，核心的在不同的地方。

如果你第一次碰到该句话，就可以当作是一个全面性的了解
所以他也是挺重要的
** clojure interop with java [#B]                                    :@work:
:LOGBOOK:
CLOCK: [2017-10-29 周日 22:31]--[2017-10-29 周日 22:31] =>  0:00
:END:
                         Added: [2017-10-29 周日 22:31]
                         

Handling Interop with Java

When a new language comes into being, it faces the library problem. That is, to be useful in everyday situations, 
a language needs to do all the things that current dominant languages do. These current dominant languages have a 
full array of libraries that support things like parsing JSON and logging.

Clojure solved this new language library problem by running on the JVM and having interoperability with Java
 classes. When you use Clojure, you can use Java classes and Java libraries. Clojure builds on the strength 
of the production-hardened and tested JVM and existing Java libraries. In fact, many of the popular Clojure
 libraries in use today utilize Java libraries as fundamental building blocks. We are going to cover the most
 common areas that you will encounter: how to import Java libraries/classes, how to create new instances of 
them, and how to interact with their methods.
** matlab coding style [#B]                                          :@F708:
:LOGBOOK:
CLOCK: [2017-10-30 周一 20:57]--[2017-10-30 周一 20:57] =>  0:00
:END:
                         Added: [2017-10-30 周一 20:57]
                         
MATLAB Coding Style

This document suggests a MATLAB coding style. This file is directed to those who code with me in the lab, but might serve for everyone out there.
Coding style

    No whitespace at the end of the line.
    Use Unix style line breaks (LF only).
    Keep line lenghts under 80 characters.
    Use 4 spaces to indent code. Add indentation for each logic level but the function operator:

function a = ackermann(m, n)
% Computes the Ackermann function.
%
if m == 0
    a = n+1;
elseif and(m > 0, n == 0)
    a = ackermann(m-1, 1);
else
    a = ackermann(m-1, ackermann(m, n-1));
end

    For while loops, the counter variable must be declared just before the while keyword:

n = 0;
while n <= 10
    disp(n);
    n = n+10;
end

    If a line is not enough to write the whole statement, break it into meaningful places, like after an operator or separating a line for each function argument:

pyt = sqrt(x^2 + ...
           y^2);
set(handles.edit, ...
    'String', ...
    sprintf('This is worth %.2f$', ...
            pyt));

Keep LISP style indentation in this case for better legibility. Sometimes, it might be a good idea too to break the line before a mathematical operator, to give a more meaningful sense to your code:

result = viscosity ...
       + shear ...
       - (acceleration * mass);

    Name variables and functions using camelCase, as it is Java after all.
    Name constants using UPPERCASE_SEPARATED_BY_UNDERSCORES.
    Always add a space near the equals sign.
    Add spaces after and before brackets in case they define an array or a cell. This space is not needed when accessing data, calling a function or anything like that:

% defining cells or arrays:
emptyCell = { };
someNumbers = [ 1 1 2 3 5 8 13 42 ];

% function call:
someNumbers(5);
someTrouble = ackermann(4, 2);

% accessing data:
emptyCell{end+1} = 19;

    Add spaces between expressions to make them more readable in case they are too long or full of text:

% expressions that needs space for readability:
result = sqrt(x1^2 + y1^2) + sqrt(x2^2 + y2^2) + sqrt(x3^2 + y3^2);
force = mass * acceleration;

% expressions that does not need space for readability:
z = i+1;
f = m*a;

    Your code is mostly like a text, with sentences are paragraphs. Therefore it is a good idea to visually separate concerns within your code with empty lines so new-comers know these concerns. Sometimes, this separations of paragraphs is more useful than documentation itself.

General practices

    Write documentation before writing code. Write documentation before writing code. Write documentation before writing code.
    State your functions' inputs and outputs when documenting it, specially the data types.
    Whenever possible, try to use MATLAB's own math functions. And try to make your own functions comply with their functions. This will make your script a lot more faster and readable.
    Make every function return something unless it is a procedure. 'What does it mean?', you might ask. Ask why for MATLAB and it will answer for you. Actually not. Procedures here can be understand as a series of transformations and steps to achieve a goal, while a function is the transformation itself. A procedure's goal is to cause a side-effect on your system, and this side-effect must be well documented and defined. A function's goal is to create another variable based on other variable's state. This distinction will make your programs less confusing to outsiders, even if they do not know it is there; specially when there are graphical user interfaces (GUIs for short) involved. For example: when you a press a button, it will usually cause a side-effect somewhere, like saving some data to a file or change something else on your GUI. This can be done by performing a procedure, creating and updating variables based on the system's current state. This distinction is subtle but turns everything clearer with practice. Seriously.

Module organization

Regardless of language, we can define a module as a collection of code that tries to solve one problem. This problem can be broad or not, but the idea is to encapsulate this problem into small pieces so the user does not have to think about what is inside. With that in mind, there are some precautions that are considered good taste:

    A MATLAB module is a folder containing functions. So try to keep all your code into one folder. Each file must contain one function that solves one problem inside this bigger problem. If this function needs a helper function, really specific to that domain, then it can be appended to this same file; the outside scripts will not see this helper function. Unless it is desired that it appears somewhere else or it is used repeatedly, this helper should not have a script file for its own.
    Whenever possible, try to solve your problem using only one script file. Most solutions should be considered just another procedure to be included in someone else's code. This is not always the case, since some problems actually need user interfaces and the whatnot, but it can be really nice to just incorporate a single file to the codebase instead of a whole system.

One issue that I have come accross during this time working with this language is that there is considerable namespace pollution given MATLAB does not have any mechanisms to deal with it. Therefore some care is desired when work with them:

    Unless the given module is always used, do not incorporate it directly to MATLAB. Instead, for each script, run the addpath function with the module path. This will keep the current namespace organized. The same applies to the Java classpath.
    One thing to pay attention is that MATLAB does not add nested modules when a folder is inserted to its path. Therefore it might be a good idea to write a function to add the modules whithin for better incorporation, unless you've got somethign to hide from everyone else.
** 流动分离 [#B]                                                     :@work:
:LOGBOOK:
CLOCK: [2017-11-01 周三 14:22]--[2017-11-01 周三 16:43] =>  2:21
:END:
                         Added: [2017-11-01 周三 14:21]
                         

风力机时常处于变风速的流动中，当来流风速接近或超过设计风速时，在叶片的根部或大部分叶展范围都有可能发生流动分离。发生流动分离后，分离流的湍流强度大大增加，引起气动损失迅速增加。同时，流动分离区导致压力平台，减小了内叶展甚至中叶展位置翼型的升力，增加了翼型的阻力。通过在叶片表面加装涡发生器，可以有效控制流动分离，提高翼型升力，降低翼型阻力，从而提高叶片风能吸收效率。
** 三维旋转效应和流动分离 [#B]                                       :@work:
:LOGBOOK:
CLOCK: [2017-11-01 周三 18:20]--[2017-11-02 周四 00:55] =>  6:35
CLOCK: [2017-11-01 周三 17:17]--[2017-11-01 周三 18:19] =>  1:02
:END:
                         Added: [2017-11-01 周三 17:17]
                         
[风力机叶片表面压力的计算与外场测试分析][李仁年] 外场试验表明，叶片表面压力分布
特征沿展向出现较大的差异性，主要原因是在外场多变环境下，高速旋转的风力机叶片存在
较强的三维旋转效应，且三维旋转效应越靠近叶片根部越明显。

当风速超过额定风速后，沿叶展方向的翼型截面会发生动态失速现象，尾涡的形成
和脱落涡将对叶片表面压力分布产生较大影响，产生剧烈的压力波动，致使叶片表面
压力与计算值出现较大差异
** whatis habits [#B]                                                :@work:
:LOGBOOK:
CLOCK: [2017-11-02 周四 20:59]--[2017-11-02 周四 21:00] =>  0:01
:END:
                         Added: [2017-11-02 周四 20:59]
                         
5.3.3 Tracking your habits

Org has the ability to track the consistency of a special category of TODOs, called “habits”. A habit has the following properties:

    You have enabled the habits module by customizing org-modules.
    The habit is a TODO item, with a TODO keyword representing an open state.
    The property STYLE is set to the value habit.
    The TODO has a scheduled date, usually with a .+ style repeat interval. A ++ style may be appropriate for habits with time constraints, e.g., must be done on weekends, or a + style for an unusual habit that can have a backlog, e.g., weekly reports.
    The TODO may also have minimum and maximum ranges specified by using the syntax ‘.+2d/3d’, which says that you want to do the task at least every three days, but at most every two days.
    You must also have state logging for the DONE state enabled (see Tracking TODO state changes), in order for historical data to be represented in the consistency graph. If it is not enabled it is not an error, but the consistency graphs will be largely meaningless. 

To give you an idea of what the above rules look like in action, here's an actual habit with some history:
{{{
     ** TODO Shave
        SCHEDULED: <2009-10-17 Sat .+2d/4d>
        - State "DONE"       from "TODO"       [2009-10-15 Thu]
        - State "DONE"       from "TODO"       [2009-10-12 Mon]
        - State "DONE"       from "TODO"       [2009-10-10 Sat]
        - State "DONE"       from "TODO"       [2009-10-04 Sun]
        - State "DONE"       from "TODO"       [2009-10-02 Fri]
        - State "DONE"       from "TODO"       [2009-09-29 Tue]
        - State "DONE"       from "TODO"       [2009-09-25 Fri]
        - State "DONE"       from "TODO"       [2009-09-19 Sat]
        - State "DONE"       from "TODO"       [2009-09-16 Wed]
        - State "DONE"       from "TODO"       [2009-09-12 Sat]
        :PROPERTIES:
        :STYLE:    habit
        :LAST_REPEAT: [2009-10-19 Mon 00:36]
        :END:
}}}
What this habit says is: I want to shave at most every 2 days (given by the SCHEDULED date and repeat interval) and
 at least every 4 days. If today is the 15th, then the habit first appears in the agenda on Oct 17, after the minimum 
of 2 days has elapsed, and will appear overdue on Oct 19, after four days have elapsed.

What's really useful about habits is that they are displayed along with a consistency graph, to show how consistent
 you've been at getting that task done in the past. This graph shows every day that the task was done over the past 
three weeks, with colors for each day. The colors used are:

Blue
    If the task wasn't to be done yet on that day.
Green
    If the task could have been done on that day.
Yellow
    If the task was going to be overdue the next day.
Red
    If the task was overdue on that day. 

In addition to coloring each day, the day is also marked with an asterisk if the task was actually done that day,
 and an exclamation mark to show where the current day falls in the graph.

There are several configuration variables that can be used to change the way habits are displayed in the agenda.

org-habit-graph-column
    The buffer column at which the consistency graph should be drawn. This will overwrite any text in that column,
 so it is a good idea to keep your habits' titles brief and to the point.
org-habit-preceding-days
    The amount of history, in days before today, to appear in consistency graphs.
org-habit-following-days
    The number of days after today that will appear in consistency graphs.
org-habit-show-habits-only-for-today
    If non-nil, only show habits in today's agenda view. This is set to true by default. 

Lastly, pressing K in the agenda buffer will cause habits to temporarily be disabled and they won't appear at all. 
Press K again to bring them back. They are also subject to tag filtering, 
if you have habits which should only be done in certain contexts, for example. 
https://www.gnu.org/software/emacs/manual/html_mono/org.html#Tracking-your-habits
** tags important [#B]                                               :@work:
:LOGBOOK:
CLOCK: [2017-11-02 周四 21:04]--[2017-11-02 周四 21:04] =>  0:00
:END:
                         Added: [2017-11-02 周四 21:04]
                         
An excellent way to implement labels and contexts for cross-correlating information is to assign tags to headlines.
 Org mode has extensive support for tags.

Every headline can contain a list of tags; they occur at the end of the headline. Tags are normal words containing 
letters, numbers, ‘_’, and ‘@’. Tags must be preceded and followed by a single colon, e.g., ‘:work:’. Several tags
 can be specified, as in ‘:work:urgent:’. Tags will by default be in bold face with the same color as the headline. 
You may specify special faces for 
specific tags using the option org-tag-faces, in much the same way as you can for TODO keywords (see Faces for TODO keywords). 
** Dynamic Stall [#B]                                               :@NCEPU:
:LOGBOOK:
CLOCK: [2018-07-25 周三 10:50]--[2018-07-25 周三 10:55] =>  0:05
:END:
                         Added: [2018-07-25 周三 10:50]
                         
                         
Yaw misalignment introduces the unsteady load , dynamic stall is very important
 because it causes the larger load than static 
 

Yaw misaligment introduces unsteady blade load(产生位置也有了). The occurentce for dynamic stall
is of particular(采用of形式来表达) in this respect, since it can yield(产生)significantly (极大地)
higher aerodynamic blade forces(又加上了balde） than for static stall(加上for， 然后在static后面
再加上stall)

spanwise and temporal extend of the dyanmic stall region 

进一步参考 [Wind turbine aerodynamic in yaw.pdf P153]


记得在cygwin安装tree
#+BEGIN_SRC bash :dir "I:\\ScienceBase.Attachments\\data missing estimation\\"
  find
#+END_SRC


#+BEGIN_SRC bash :dir "I:\\ScienceBase.Attachments\\data missing estimation\\"
  perl hello.pl 
#+END_SRC


#+RESULTS:
** NoteExpress标记 [#B]                                             :@NCEPU:
:LOGBOOK:
CLOCK: [2018-08-04 周六 09:33]--[2018-08-04 周六 09:44] =>  0:11
:END:
                         Added: [2018-08-04 周六 09:32]
                         

标记星级+优先级(刚开始是一级，如果觉得好变成2级，再看一遍觉得特别不错，变成三级..)
** 搜索引擎出现的必然 [#B]                                          :@NCEPU:
:LOGBOOK:
CLOCK: [2018-08-04 周六 09:44]--[2018-08-04 周六 09:45] =>  0:01
:END:
                         Added: [2018-08-04 周六 09:44]
                         
从只言片语到书册，再到图书馆以及搜索引擎
https://www.baidu.com/s?wd=how%20search%20works&rsv_spt=1&rsv_iqid=0x9c499bc9000313b6&issp=1&f=8&rsv_bp=0&rsv_idx=2&ie=utf-8&tn=baiduhome_pg&rsv_enter=1&rsv_sug3=17&rsv_sug1=7&rsv_sug7=100&rsv_sug2=0&inputT=4271&rsv_sug4=4272

1. 爬虫抓取信息(following links ,inside links  connected into thousands and millions information web)，按照高质量网站优先原则
2. 进行index
3. 通过算法，better understand what you mean理解你的输入内容，进行搜索 base on the relevent clues, 
4. 不断过滤掉垃圾网页（site & page quality高质量网站显示在前! 

https://www.google.com/intl/bn/insidesearch/howsearchworks/thestory/
Jake Hubert, Google Product Manager, said in a blog, “Here you can follow the entire life of a search query,
 from the web, to crawling and indexing(1), to algorithmic ranking(2) and serving(3), to fighting webspam(去掉垃圾信息).”
 

 
1. keyword
2. rank and sort(整理)
3. qualitiy


级别1： 只会输入单词的
级别2： 关键词组合 基本逻辑关系(and：空格表示 or not)  高级检索(site:  ftp:   filetype:pdf)
句子的话涉及拆词问题(关键词组合，跟浏览器的搜商有关)，  + 强制添加   -减号强制剔除
级别3： 高校检索 黑客级别

各个搜搜引擎差异在于专业性知识收集不同、展示界面不同

乔纳森-弗莱彻：被遗忘的搜索引擎之父
腾讯科技[微博]瑞雪2013年09月05日02:47我要分享
[导读]20年前，弗莱彻发明了全世界第一个能进行网络搜索的搜索引擎。

乔纳森-弗莱彻：被遗忘的搜索引擎之父

弗莱彻（中）与SIGIR大会的其他与会者在一起（腾讯科技配图）

腾讯科技 瑞雪 9月5日编译

在谷歌(微博)庆祝其15周年诞辰之际，这家网络巨头已经成为信息检索的代名词。

但是，如果你在谷歌搜索引擎中输入乔纳森·弗莱彻（Jonathon Fletcher）的名字，那么在马上得出的搜索结果中不会找到什么线索指向他曾在万维网发展的过程中所扮演的角色。当然，也不会有任何信息能表明他作为现代搜索引擎之父的身份。

但在20年以前，正是弗莱彻在苏格兰斯特灵大学（University of Stirling）的一个电脑实验室中发明了全世界第一个能进行网络搜索的搜索引擎，也正是他发明的这种技术为谷歌、必应（Bing）、雅虎和今天网络上的所有大型搜索工具提供了支持。

解决网络搜索问题

在1993年时，网络正处于刚刚开始发展的婴儿期。在那时，第一个拥有类似于今天我们使用的界面的流行浏览器Mosaic刚刚发布，网页的总数量还只是以千为单位来进行计算而已。

尽管当时网络已经诞生，但如何在网络上找到内容的问题尚未得到解决。Mosaic拥有一个名为“What's New”的页面，能在新网站被创立时检索到这些网站。但问题在于，如果想要Mosaic的开发者能够知道一个新网站的诞生，那么其创立者就必须写信给美国伊利诺伊大学香槟分校（University of Illinois Urbana-Champaign）的国家超级计算应用中心（NCSA），也就是Mosaic浏览器团队的基地。

在那时，弗莱彻是斯特灵大学一名颇有前途的研究生，而且已经被推荐到格拉斯哥大学（University of Glasgow）攻读博士学位。但是，格拉斯哥大学的资金链在弗莱彻还没能到这所大学以前就已断裂，这让他变得无所事事。

“在突然之间，我变得非常渴望找到一种收入来源。”弗莱彻回忆道。“因此我回到了原来的大学，找到了一个为技术部门工作的岗位。”

正是在这个工作岗位上，弗莱彻第一次与万维网和Mosaic的“What's New”页面邂逅。

更好的方法

在为斯特灵大学建设一个网络服务器的过程中，弗莱彻意识到，“What's New”页面存在根本上的缺陷。由于网站是以人工方式被添加到这个网页的列表中的缘故，没有什么东西能被用来追踪网站内容的变化。其结果是，许多链接很快就会变得过期或是被错误标记。

“如果你想要看看有什么东西发生了变化，那么就不得不回过头去查看。”弗莱彻在谈及Mosaic的链接时说道。“抱着必须推出一种更好的方法的念头，拥有计算机科学学位的我决定要编写一些东西来改变这种情况。”

弗莱彻所说的“一些东西”就是全世界的第一个“网络爬虫”（web crawler）。弗莱彻把自己的这种发明称作“JumpStation”，他建立起了一个页面索引，能通过“网络爬虫”来对页面进行搜索，这基本上来说是一种自动化的处理程序，能对被其发现的每个网站页面进行访问和索引。这种自动化处理的程序会一直继续下去，直到“网络爬虫”再也找不到东西可以访问时为止。

在十年以后，也就是1993年12月21日，JumpStation就再也找不到可以访问的东西，结果是将2.5万个页面编入索引。而在今天，谷歌已经编入索引的页面数量已经超过了1万亿个。

乔纳森-弗莱彻：被遗忘的搜索引擎之父

JumpStatio诞生几个月以前的“What's New”页面（腾讯科技配图）

搜索的诞生

弗莱彻很快就为这个索引开发出了一种易于导航的搜索工具，将自己的网站嵌入了Mosaic的“What's New”页面，这标志着全世界第一个现代搜索引擎开始运作。

“我会说，他是网络搜索引擎之父。”墨尔本皇家理工大学（Royal Melbourne Instituteof Technology）的马克·桑德森（Mark Sanderson）教授说道，他专门负责研究信息检索的历史。“（在弗莱彻发明第一个网络搜索引擎之前的）很长一段时间里，很明显一直都有计算机在从事搜索工作；在网络诞生以前，当然也已经有搜索引擎存在。然而，是弗莱彻第一个创造了一种拥有现代搜索引擎所有组成部分的搜索引擎。”

但在今天，谷歌的两名联合创始人塞吉·布林（Sergey Brin）和拉里·佩奇（Larry Page）都已经成为家喻户晓的名人，而目前居住在中国香港的弗莱彻却几乎没有因为他为互联网进化作出的贡献而为人所知。

之所以会出现这种情况，或许与他的项目最终被放弃有关。随着JumpStation的成长，这个项目需要的投资越来越大，而这种投资却是斯特灵大学所不愿提供的。“当时JumpStation是在一个共享服务器上运行的。”弗莱彻解释道。“那时没有很大的磁盘空间，而且当时的磁盘很小，价格也很昂贵。”

空间控制

到1994年6月份，JumpStation已经对27.5万个页面进行了索引。空间方面的限制迫使弗莱彻仅对网页的标题进行索引，而不是对网页的全部内容进行索引；但即使是在作出了这种妥协以后，JumpStation也仍旧开始面临着过载的困境。

弗莱彻也同样已不堪重负。“那并非我的本职工作。”他说道。“那时我的工作职责是维持学生实验室的正常运作，并从事一些系统管理和技术方面的杂活儿。”

在当时，弗莱彻得到了一个到东京工作的机会。对他来说，这个工作机会的吸引力大到令人难以抗拒，而斯特灵大学也几乎没有尝试做些什么来挽留他或是挽留JumpStation。

“很明显，在尝试说服他们相信这个项目很有潜力的问题上，我做得很不成功。”弗莱彻说道。“在当时，我做了自己认为是正确的事情（到日本去工作）。但在过去20年时间里，总有那么些时候我会回首这段往事。”

斯特灵大学计算机科学及数学系主任莱斯利·史密斯（Leslie Smith）教授还记得弗莱彻，他承认JumpStation最终“被证明是领先于时代的”，并在接受BBC采访时表示：“斯特灵大学的同仁们都为他能因自己取得的成就而为人所知感到高兴。”

未来展望

尽管弗莱彻对不得不放弃JumpStation项目而感到失望，但他的这种先驱技术在后来却成为了所有网络搜索引擎的基础。

“在1993年时，网络社区的规模非常小。”桑德森教授说道。“在当时，在网上做任何事情的人都会知道JumpStation。”他还补充道：“到1994年年中前后，网络搜索引擎将变得非常重要这件事情已经开始变得明显。谷歌直到1998年才出现，而弗莱彻在1993年就已经做了这件事情。”

在几个星期以前于爱尔兰首都都柏林召开的SIGIR（国际计算机协会主办的国际信息检索大会）上，弗莱彻由于他在网络搜索引擎方面作出的成就而获得了一些知名度。在当时，他曾跟来自于微软、雅虎和谷歌的与会代表进行过小组讨论。但在弗莱彻的言谈中，他所谈论的并非自己以往的成就，而是对未来作出了展望。

“在我看来，网络不会永远存在。”弗莱彻说道。“但是，找到信息的问题则将永远存在，因为对内容进行搜索并找到信息的愿望是独立于媒介以外的。”

对于追随弗莱彻其后建立起网络搜索引擎的人们来说，当前的这种媒介已经让他们赚到了大笔的钞票。但是，弗莱彻这位出生于英格兰自治市斯卡伯勒（Scarborough）的先驱者并不对此感到遗憾。“我的父母以我为骄傲，我的妻子和孩子也是如此。对我来说，这才是无价之宝，所以我感到非常幸福。”
